
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Объект.СуммаЧека = Объект.Номенклатура.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ПолучимСуммыПоЧекам();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучимСуммыПоЧекам()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМОбороты.СуммаЧекаОборот КАК СуммаЧекаОборот
		|ИЗ
		|	РегистрНакопления.ЧекККМ.Обороты(&НачалоПериода, &КонецПериода, , Контрагент = &Контрагент) КАК ЧекККМОбороты
		|ГДЕ
		|	ЧекККМОбороты.СуммаЧекаОборот >= 50000";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Элементы.Сертификаты.Видимость = Истина;
		Серт = Объект.Сертификаты.Добавить();
		Серт.Сертификат = Справочники.Номенклатура.Сертификат;
		Серт.Количество = 1;
		Серт.Статус = Перечисления.СтатусДвиженияСертификатов.ВНаличии;
	КонецЕсли;	
		
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Сертификаты.Видимость = Ложь;
	
КонецПроцедуры
