
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Объект.СуммаЧека = Объект.Номенклатура.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если РежимЗаписиДокумента.Проведение Тогда
		
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучимСуммыПоЧекам()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМОбороты.СуммаЧекаОборот КАК СуммаЧекаОборот
		|ИЗ
		|	РегистрНакопления.ЧекККМ.Обороты(&НачалоПериода, &КонецПериода, , Контрагент = &Контрагент) КАК ЧекККМОбороты";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
		
КонецФункции
